#include <stdio.h>
#include <stdlib.h>
#include <Windows.h>

int main()
{
    SetConsoleCP(1251); // Цей і наступний рядок відповідає для підключення української мови
    SetConsoleOutputCP(1251);
    int n, t = 0;
    printf("Введіть натуральне число n: ");
    scanf("%d", &n); // Введення числа n
    if (n > 150 || n < 1) // Умова, яка стояла в задачі
        printf("Error"); // Якщо умова виконується, то спрацює цей рядок
    else
    {
        for (int i = 1; i <= n; i++) // Цикл для перебірки всіх чисел, які не перевищують n
        {
            if (n % i == n / i) // Умова, для отримання результату
                t++; // Лічильник
        }
    printf("Кількість рівних дільників числа %d: %d\n", n, t); // Виведення результату
    }
    return 0;
}
