#include <stdio.h>
#include <math.h>

int main() {
    int p, num;

    scanf("%d", &p); // Введення числа p (розрядності)

    if (p > 1 && p <= 30) // Умова введеного числа
    {
        num = pow(p, 2) - ((p - 2) * 3); // Формула для розв'язання (перевіряв формулу, записуючи всі числа, які можуть бути при різних розрядностях,
        printf("%d\n", num);             // але коректно рахує тільки ця)
    }
    else
        printf("Error\n"); // Цей рядок виводиться якщо умова не працює

    return 0;
}
