#include <stdio.h>
#include <stdlib.h>
#include <math.h>

int main()
{
    int x1, y1, r1, x2, y2, r2;
    scanf("%d %d %d %d %d %d", &x1, &y1, &r1, &x2, &y2, &r2); // Введення координат

    int d = sqrt(pow((x2 - x1), 2) + pow((y2 - y1), 2)); // Знаходження відстані між точками

    if (x1 = x2 && y1 == y2 && r1 == r2) // Умова, якщо всі точки і радіуси рівні
        printf("-1\n");
    if (d > fabs(r1 - r2) && d < (r1 + r2)) // Умова, якщо відстань між точками більша за різницю радіусів по модулю, але менша за суму радіусів
        printf("2\n");
    if (d == (r1 + r2)) // Умова при якій відстань між точками рівна сумі радіусів
        printf("1\n");
    if (d > (r1 + r2) || d < fabs(r1 - r2)) // Умова, якщо відстань між точками більша за суму радіусів або менша за різницю радіусів по модулю
        printf("0\n");

    return 0;
}
