#include <stdio.h>
#include <stdlib.h>

int main()
{
    int p, i, t = 0;

    scanf("%d", &p); // Введення числа p

    if (p >= 2 && p <= 20)
    {
        int arr[p]; // Масив розміром, який був зазначений як p

        for (i = 0; i < p; i++) // Введення чисел через пробіл
        {
            scanf("%d", &arr[i]);
        }

        t = arr[0]; // Присвоюємо для t перше число масиву
        for (i = 1; i < p; i++) // Цикл для розв'язку задачі
        {
            int a = t;
            int b = arr[i];

            while (a != b) // Цикл для того щоб знайти НСД (алгоритм Евкліда)
            {
                if (a > b)
                    a -= b;
                else
                    b -= a;
            }

            t = (t * arr[i]) / a; // Формула для знаходження НСК
        }

        printf("%d\n", t); // Виведення НСК
    }
    else
    {
        printf("Error\n"); // Якщо число не належить зазначеному проміжку
    }

    return 0;
}

